zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/component/tc.h
/* -------- TC_SMMR : (TC Offset: 0x08) (R/W 32) channel Stepper Motor Mode Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t GCEN:1;           /*!< bit:      0  Gray Count Enable                  */
    uint32_t DOWN:1;           /*!< bit:      1  Down Count                         */
    uint32_t :30;              /*!< bit:  2..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} TC_SMMR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TC_SMMR_OFFSET              0x08         /**< \brief (TC_SMMR offset) Stepper Motor Mode Register */
#define TC_SMMR_RESETVALUE          _U_(0x00000000); /**< \brief (TC_SMMR reset_value) Stepper Motor Mode Register */

#define TC_SMMR_GCEN_Pos            0            /**< \brief (TC_SMMR) Gray Count Enable */
#define TC_SMMR_GCEN                (_U_(0x1) << TC_SMMR_GCEN_Pos)
#define TC_SMMR_DOWN_Pos            1            /**< \brief (TC_SMMR) Down Count */
#define TC_SMMR_DOWN                (_U_(0x1) << TC_SMMR_DOWN_Pos)
#define TC_SMMR_MASK                _U_(0x00000003) /**< \brief (TC_SMMR) MASK Register */

/* -------- TC_CV : (TC Offset: 0x10) (R/  32) channel Counter Value Channel -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t CV:16;            /*!< bit:  0..15  Counter Value                      */
    uint32_t :16;              /*!< bit: 16..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} TC_CV_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TC_CV_OFFSET                0x10         /**< \brief (TC_CV offset) Counter Value Channel */
#define TC_CV_RESETVALUE            _U_(0x00000000); /**< \brief (TC_CV reset_value) Counter Value Channel */

#define TC_CV_CV_Pos                0            /**< \brief (TC_CV) Counter Value */
#define TC_CV_CV_Msk                (_U_(0xFFFF) << TC_CV_CV_Pos)
#define TC_CV_CV(value)             (TC_CV_CV_Msk & ((value) << TC_CV_CV_Pos))
#define TC_CV_MASK                  _U_(0x0000FFFF) /**< \brief (TC_CV) MASK Register */

/* -------- TC_RA : (TC Offset: 0x14) (R/W 32) channel Register A Channel -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RA:16;            /*!< bit:  0..15  Register A                         */
    uint32_t :16;              /*!< bit: 16..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} TC_RA_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TC_RA_OFFSET                0x14         /**< \brief (TC_RA offset) Register A Channel */
#define TC_RA_RESETVALUE            _U_(0x00000000); /**< \brief (TC_RA reset_value) Register A Channel */

#define TC_RA_RA_Pos                0            /**< \brief (TC_RA) Register A */
#define TC_RA_RA_Msk                (_U_(0xFFFF) << TC_RA_RA_Pos)
#define TC_RA_RA(value)             (TC_RA_RA_Msk & ((value) << TC_RA_RA_Pos))
#define TC_RA_MASK                  _U_(0x0000FFFF) /**< \brief (TC_RA) MASK Register */

/* -------- TC_RB : (TC Offset: 0x18) (R/W 32) channel Register B Channel -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RB:16;            /*!< bit:  0..15  Register B                         */
    uint32_t :16;              /*!< bit: 16..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} TC_RB_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TC_RB_OFFSET                0x18         /**< \brief (TC_RB offset) Register B Channel */
#define TC_RB_RESETVALUE            _U_(0x00000000); /**< \brief (TC_RB reset_value) Register B Channel */

#define TC_RB_RB_Pos                0            /**< \brief (TC_RB) Register B */
#define TC_RB_RB_Msk                (_U_(0xFFFF) << TC_RB_RB_Pos)
#define TC_RB_RB(value)             (TC_RB_RB_Msk & ((value) << TC_RB_RB_Pos))
#define TC_RB_MASK                  _U_(0x0000FFFF) /**< \brief (TC_RB) MASK Register */

/* -------- TC_RC : (TC Offset: 0x1C) (R/W 32) channel Register C Channel -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RC:16;            /*!< bit:  0..15  Register C                         */
    uint32_t :16;              /*!< bit: 16..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} TC_RC_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TC_RC_OFFSET                0x1C         /**< \brief (TC_RC offset) Register C Channel */
#define TC_RC_RESETVALUE            _U_(0x00000000); /**< \brief (TC_RC reset_value) Register C Channel */

#define TC_RC_RC_Pos                0            /**< \brief (TC_RC) Register C */
#define TC_RC_RC_Msk                (_U_(0xFFFF) << TC_RC_RC_Pos)
#define TC_RC_RC(value)             (TC_RC_RC_Msk & ((value) << TC_RC_RC_Pos))
#define TC_RC_MASK                  _U_(0x0000FFFF) /**< \brief (TC_RC) MASK Register */

/* -------- TC_SR : (TC Offset: 0x20) (R/  32) channel Status Register Channel -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t COVFS:1;          /*!< bit:      0  Counter Overflow Status            */
    uint32_t LOVRS:1;          /*!< bit:      1  Load Overrun Status                */
    uint32_t CPAS:1;           /*!< bit:      2  RA Compare Status                  */
    uint32_t CPBS:1;           /*!< bit:      3  RB Compare Status                  */
    uint32_t CPCS:1;           /*!< bit:      4  RC Compare Status                  */
    uint32_t LDRAS:1;          /*!< bit:      5  RA Loading Status                  */
    uint32_t LDRBS:1;          /*!< bit:      6  RB Loading Status                  */
    uint32_t ETRGS:1;          /*!< bit:      7  External Trigger Status            */
    uint32_t :8;               /*!< bit:  8..15  Reserved                           */
    uint32_t CLKSTA:1;         /*!< bit:     16  Clock Enabling Status              */
    uint32_t MTIOA:1;          /*!< bit:     17  TIOA Mirror                        */
    uint32_t MTIOB:1;          /*!< bit:     18  TIOB Mirror                        */
    uint32_t :13;              /*!< bit: 19..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} TC_SR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TC_SR_OFFSET                0x20         /**< \brief (TC_SR offset) Status Register Channel */
#define TC_SR_RESETVALUE            _U_(0x00000000); /**< \brief (TC_SR reset_value) Status Register Channel */

#define TC_SR_COVFS_Pos             0            /**< \brief (TC_SR) Counter Overflow Status */
#define TC_SR_COVFS                 (_U_(0x1) << TC_SR_COVFS_Pos)
#define   TC_SR_COVFS_0_Val               _U_(0x0)   /**< \brief (TC_SR) No counter overflow has occurred since the last read of the Status Register. */
#define   TC_SR_COVFS_1_Val               _U_(0x1)   /**< \brief (TC_SR) A counter overflow has occurred since the last read of the Status Register. */
#define TC_SR_COVFS_0               (TC_SR_COVFS_0_Val             << TC_SR_COVFS_Pos)
#define TC_SR_COVFS_1               (TC_SR_COVFS_1_Val             << TC_SR_COVFS_Pos)
#define TC_SR_LOVRS_Pos             1            /**< \brief (TC_SR) Load Overrun Status */
#define TC_SR_LOVRS                 (_U_(0x1) << TC_SR_LOVRS_Pos)
#define   TC_SR_LOVRS_0_Val               _U_(0x0)   /**< \brief (TC_SR) Load overrun has not occurred since the last read of the Status Register or WAVE:1. */
#define   TC_SR_LOVRS_1_Val               _U_(0x1)   /**< \brief (TC_SR) RA or RB have been loaded at least twice without any read of the corresponding register since the last read of the StatusRegister, if WAVE:0. */
#define TC_SR_LOVRS_0               (TC_SR_LOVRS_0_Val             << TC_SR_LOVRS_Pos)
#define TC_SR_LOVRS_1               (TC_SR_LOVRS_1_Val             << TC_SR_LOVRS_Pos)
#define TC_SR_CPAS_Pos              2            /**< \brief (TC_SR) RA Compare Status */
#define TC_SR_CPAS                  (_U_(0x1) << TC_SR_CPAS_Pos)
#define   TC_SR_CPAS_0_Val                _U_(0x0)   /**< \brief (TC_SR) RA Compare has not occurred since the last read of the Status Register or WAVE:0. */
#define   TC_SR_CPAS_1_Val                _U_(0x1)   /**< \brief (TC_SR) RA Compare has occurred since the last read of the Status Register, if WAVE:1. */
#define TC_SR_CPAS_0                (TC_SR_CPAS_0_Val              << TC_SR_CPAS_Pos)
#define TC_SR_CPAS_1                (TC_SR_CPAS_1_Val              << TC_SR_CPAS_Pos)
#define TC_SR_CPBS_Pos              3            /**< \brief (TC_SR) RB Compare Status */
#define TC_SR_CPBS                  (_U_(0x1) << TC_SR_CPBS_Pos)
#define   TC_SR_CPBS_0_Val                _U_(0x0)   /**< \brief (TC_SR) RB Compare has not occurred since the last read of the Status Register or WAVE:0. */
#define   TC_SR_CPBS_1_Val                _U_(0x1)   /**< \brief (TC_SR) RB Compare has occurred since the last read of the Status Register, if WAVE:1. */
#define TC_SR_CPBS_0                (TC_SR_CPBS_0_Val              << TC_SR_CPBS_Pos)
#define TC_SR_CPBS_1                (TC_SR_CPBS_1_Val              << TC_SR_CPBS_Pos)
#define TC_SR_CPCS_Pos              4            /**< \brief (TC_SR) RC Compare Status */
#define TC_SR_CPCS                  (_U_(0x1) << TC_SR_CPCS_Pos)
#define   TC_SR_CPCS_0_Val                _U_(0x0)   /**< \brief (TC_SR) RC Compare has not occurred since the last read of the Status Register. */
#define   TC_SR_CPCS_1_Val                _U_(0x1)   /**< \brief (TC_SR) RC Compare has occurred since the last read of the Status Register. */
#define TC_SR_CPCS_0                (TC_SR_CPCS_0_Val              << TC_SR_CPCS_Pos)
#define TC_SR_CPCS_1                (TC_SR_CPCS_1_Val              << TC_SR_CPCS_Pos)
#define TC_SR_LDRAS_Pos             5            /**< \brief (TC_SR) RA Loading Status */
#define TC_SR_LDRAS                 (_U_(0x1) << TC_SR_LDRAS_Pos)
#define   TC_SR_LDRAS_0_Val               _U_(0x0)   /**< \brief (TC_SR) RA Load has not occurred since the last read of the Status Register or WAVE:1. */
#define   TC_SR_LDRAS_1_Val               _U_(0x1)   /**< \brief (TC_SR) RA Load has occurred since the last read of the Status Register, if WAVE:0. */
#define TC_SR_LDRAS_0               (TC_SR_LDRAS_0_Val             << TC_SR_LDRAS_Pos)
#define TC_SR_LDRAS_1               (TC_SR_LDRAS_1_Val             << TC_SR_LDRAS_Pos)
#define TC_SR_LDRBS_Pos             6            /**< \brief (TC_SR) RB Loading Status */
#define TC_SR_LDRBS                 (_U_(0x1) << TC_SR_LDRBS_Pos)
#define   TC_SR_LDRBS_0_Val               _U_(0x0)   /**< \brief (TC_SR) RB Load has not occurred since the last read of the Status Register or WAVE:1. */
#define   TC_SR_LDRBS_1_Val               _U_(0x1)   /**< \brief (TC_SR) RB Load has occurred since the last read of the Status Register, if WAVE:0. */
#define TC_SR_LDRBS_0               (TC_SR_LDRBS_0_Val             << TC_SR_LDRBS_Pos)
#define TC_SR_LDRBS_1               (TC_SR_LDRBS_1_Val             << TC_SR_LDRBS_Pos)
#define TC_SR_ETRGS_Pos             7            /**< \brief (TC_SR) External Trigger Status */
#define TC_SR_ETRGS                 (_U_(0x1) << TC_SR_ETRGS_Pos)
#define   TC_SR_ETRGS_0_Val               _U_(0x0)   /**< \brief (TC_SR) External trigger has not occurred since the last read of the Status Register. */
#define   TC_SR_ETRGS_1_Val               _U_(0x1)   /**< \brief (TC_SR) External trigger has occurred since the last read of the Status Register. */
#define TC_SR_ETRGS_0               (TC_SR_ETRGS_0_Val             << TC_SR_ETRGS_Pos)
#define TC_SR_ETRGS_1               (TC_SR_ETRGS_1_Val             << TC_SR_ETRGS_Pos)
#define TC_SR_CLKSTA_Pos            16           /**< \brief (TC_SR) Clock Enabling Status */
#define TC_SR_CLKSTA                (_U_(0x1) << TC_SR_CLKSTA_Pos)
#define   TC_SR_CLKSTA_0_Val              _U_(0x0)   /**< \brief (TC_SR) Clock is disabled. */
#define   TC_SR_CLKSTA_1_Val              _U_(0x1)   /**< \brief (TC_SR) Clock is enabled. */
#define TC_SR_CLKSTA_0              (TC_SR_CLKSTA_0_Val            << TC_SR_CLKSTA_Pos)
#define TC_SR_CLKSTA_1              (TC_SR_CLKSTA_1_Val            << TC_SR_CLKSTA_Pos)
#define TC_SR_MTIOA_Pos             17           /**< \brief (TC_SR) TIOA Mirror */
#define TC_SR_MTIOA                 (_U_(0x1) << TC_SR_MTIOA_Pos)
#define   TC_SR_MTIOA_0_Val               _U_(0x0)   /**< \brief (TC_SR) TIOA is low. If WAVE:0, this means that TIOA pin is low. If WAVE:1, this means that TIOA is driven low. */
#define   TC_SR_MTIOA_1_Val               _U_(0x1)   /**< \brief (TC_SR) TIOA is high. If WAVE:0, this means that TIOA pin is high. If WAVE:1, this means that TIOA is driven high. */
#define TC_SR_MTIOA_0               (TC_SR_MTIOA_0_Val             << TC_SR_MTIOA_Pos)
#define TC_SR_MTIOA_1               (TC_SR_MTIOA_1_Val             << TC_SR_MTIOA_Pos)
#define TC_SR_MTIOB_Pos             18           /**< \brief (TC_SR) TIOB Mirror */
#define TC_SR_MTIOB                 (_U_(0x1) << TC_SR_MTIOB_Pos)
#define   TC_SR_MTIOB_0_Val               _U_(0x0)   /**< \brief (TC_SR) TIOB is low. If WAVE:0, this means that TIOB pin is low. If WAVE:1, this means that TIOB is driven low. */
#define   TC_SR_MTIOB_1_Val               _U_(0x1)   /**< \brief (TC_SR) TIOB is high. If WAVE:0, this means that TIOB pin is high. If WAVE:1, this means that TIOB is driven high. */
#define TC_SR_MTIOB_0               (TC_SR_MTIOB_0_Val             << TC_SR_MTIOB_Pos)
#define TC_SR_MTIOB_1               (TC_SR_MTIOB_1_Val             << TC_SR_MTIOB_Pos)
#define TC_SR_MASK                  _U_(0x000700FF) /**< \brief (TC_SR) MASK Register */

/* -------- TC_IER : (TC Offset: 0x24) ( /W 32) channel Interrupt Enable Register Channel -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t COVFS:1;          /*!< bit:      0  Counter Overflow                   */
    uint32_t LOVRS:1;          /*!< bit:      1  Load Overrun                       */
    uint32_t CPAS:1;           /*!< bit:      2  RA Compare                         */
    uint32_t CPBS:1;           /*!< bit:      3  RB Compare                         */
    uint32_t CPCS:1;           /*!< bit:      4  RC Compare                         */
    uint32_t LDRAS:1;          /*!< bit:      5  RA Loading                         */
    uint32_t LDRBS:1;          /*!< bit:      6  RB Loading                         */
    uint32_t ETRGS:1;          /*!< bit:      7  External Trigger                   */
    uint32_t :24;              /*!< bit:  8..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} TC_IER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TC_IER_OFFSET               0x24         /**< \brief (TC_IER offset) Interrupt Enable Register Channel */
#define TC_IER_RESETVALUE           _U_(0x00000000); /**< \brief (TC_IER reset_value) Interrupt Enable Register Channel */

